# 최종 발표할 때 코드
# algorithm stations preprocessing 짬뽕시킴

import time

stations ={
'가능':{
'name':'가능',
        'line':['1'],
        'time': 2,
        'around': ['녹양','의정부']
},
'강매':{
        'name':'행신',
        'line':['경의중앙'],
        'time': 2,
        'around': ['행신','화전']
},
'가락시장':{
        'name':'가락시장',
        'line':['3','8'],
        'time': 2,
        'around': ['수서','경찰병원','송파', '문정']
          },
'가산디지털단지':{
        'name':'가산디지털단지',
        'line':['1','7'],
        'time': 1.33,
        'around': ['구로','남구로','철산', '독산']
          },
'가양':{
        'name':'가양',
        'line':['9'],
        'time': 2,
        'around': ['양천향교','증미']
          },
'가좌':{
        'name':'가좌',
        'line':['경의중앙'],
        'time': 2,
        'around': ['디지털미디어시티','홍대입구']
          },
'간석':{
        'name':'간석',
        'line':['1'],
        'time': 2,
        'around': ['동암','주안']
          },
'강남':{
        'name':'강남',
        'line':['2'],
        'time': 1,
        'around': ['역삼','교대']
          },
'강남구청':{
        'name':'강남구청',
        'line':['7'],
        'time': 1.5,
        'around': ['학동','청담']
          },
'강동':{
        'name':'강동',
        'line':['5'],
        'time': 1.16,
        'around': ['천호','길동']
          },
'강동구청':{
        'name':'강동구청',
        'line':['8'],
        'time': 1.32,
        'around': ['천호','몽촌토성']
          },
'강변':{
        'name':'강변',
        'line':['2'],
        'time': 1,
        'around': ['구의','잠실나루']
          },
'개롱':{
        'name':'개롱',
        'line':['5'],
        'time': 2,
        'around': ['거여','오금']
          },
'개봉':{
        'name':'개봉',
        'line':['1'],
        'time': 2,
        'around': ['오류동','구일']
          },
'개화':{
        'name':'개화',
        'line':['9'],
        'time': 1.5,
        'around': ['김포공항']
          },
'개화산':{
        'name':'개화산',
        'line':['5'],
        'time': 1.5,
        'around': ['방화','김포공항']
          },
'거여':{
        'name':'거여',
        'line':['5'],
        'time': 1.33,
        'around': ['개롱','마천']
          },
'건대입구':{
        'name':'건대입구',
        'line':['2','7'],
        'time': 1.5,
        'around': ['뚝섬유원지','어린이대공원','구의', '성수']
          },
'경마공원':{
        'name':'경마공원',
        'line':['4'],
        'time': 2,
        'around': ['선바위','대공원']
          },
'경복궁':{
        'name':'경복궁',
        'line':['3'],
        'time': 2,
        'around': ['독립문','안국']
          },
'경찰병원':{
        'name':'경찰병원',
        'line':['3'],
        'time': 1,
        'around': ['가락시장','오금']
          },
'고덕':{
        'name':'고덕',
        'line':['5'],
        'time': 1.67,
        'around': ['명일','상일동']
          },
'고려대':{
        'name':'고려대',
        'line':['6'],
        'time': 1.16,
        'around': ['안암','월곡']
          },
'고속터미널':{
        'name':'고속터미널',
        'line':['3','7', '9'],
        'time': 1.5,
        'around': ['잠원','교대','내방', '반포', '신반포', '사평']
          },
'고잔':{
        'name':'고잔',
        'line':['4'],
        'time': 2,
        'around': ['중앙','초지']
          },
'곡산':{
        'name':'곡산',
        'line':['경의중앙'],
        'time': 2,
        'around': ['백마','대곡']
          },
'공덕':{
        'name':'공덕',
        'line':['5','6','경의중앙'],
        'time': 1.16,
        'around': ['대흥','효창공원앞','애오개', '마포', '서강대']
          },
'공릉':{
        'name':'공릉',
        'line':['7'],
        'time': 1.5,
        'around': ['하계','태릉입구']
          },
'공항시장':{
        'name':'공항시장',
        'line':['9'],
        'time': 2,
        'around': ['김포공항','신방화']
          },
'과천':{
        'name':'과천',
        'line':['4'],
        'time': 2,
        'around': ['정부과천청사','대공원']
          },
'관악':{
        'name':'관악',
        'line':['1'],
        'time': 2,
        'around': ['석수','안양']
          },
'광나루':{
        'name':'광나루',
        'line':['5'],
        'time': 1.84,
        'around': ['아차산','천호']
          },
'광명':{
        'name':'광명',
        'line':['1'],
        'time': 2,
        'around': ['금천구청']
          },
'광명사거리':{
        'name':'광명사거리',
        'line':['7'],
        'time': 1.84,
        'around': ['천왕','철산']
          },
'광운대':{
        'name':'광운대',
        'line':['1'],
        'time': 2,
        'around': ['월계','석계']
          },
'광화문':{
        'name':'광화문',
        'line':['5'],
        'time': 1.5,
        'around': ['서대문','종로3가']
          },
'광흥창':{
        'name':'광흥창',
        'line':['6'],
        'time': 1.16,
        'around': ['상수','대흥']
          },
'교대':{
        'name':'교대',
        'line':['2','3'],
        'time': 1.5,
        'around': ['고속터미널','남부터미널','서초','강남']
          },
'구로':{
        'name':'구로',
        'line':['1'],
        'time': 2,
        'around': ['신도림','구일']
          },
'구로디지털단지':{
        'name':'구로디지털단지',
        'line':['2'],
        'time': 1.5,
        'around': ['대림','신대방']
          },
'구리':{
        'name':'구리',
        'line':['경의중앙'],
        'time': 2,
        'around': ['양원','도농']
          },
'구반포':{
        'name':'구반포',
        'line':['9'],
        'time': 2,
        'around': ['신반포','동작']
          },
'구산':{
        'name':'구산',
        'line':['6'],
        'time': 2,
        'around': ['연신내','응암']
          },
'구의':{
        'name':'구의',
        'line':['2'],
        'time': 2,
        'around': ['건대입구','강변']
          },
'구일':{
        'name':'구일',
        'line':['1'],
        'time': 2,
        'around': ['개봉','구로']
          },
'구파발':{
        'name':'구파발',
        'line':['3'],
        'time': 2.5,
        'around': ['지축','연신내']
          },
'국수':{
        'name':'국수',
        'line':['경의중앙'],
        'time': 2,
        'around': ['신원','아신']
          },
'국회의사당':{
        'name':'국회의사당',
        'line':['9'],
        'time': 2,
        'around': ['당산','여의도']
          },
'군자':{
        'name':'군자',
        'line':['5','7'],
        'time': 1.67,
        'around': ['장한평','아차산','중곡','어린이대공원']
          },
'군포':{
        'name':'군포',
        'line':['1'],
        'time': 2,
        'around': ['금정','당정']
          },
'굴포천':{
        'name':'굴포천',
        'line':['7'],
        'time': 2,
        'around': ['삼산체육관','부평구청']
          },
'굽은다리':{
        'name':'굽은다리',
        'line':['5'],
        'time': 1.16,
        'around': ['명일','길동']
          },
'금릉':{
        'name':'금릉',
        'line':['경의중앙'],
        'time': 2,
        'around': ['금촌','운정']
          },
'금정':{
        'name':'금정',
        'line':['1','4'],
        'time': 2,
        'around': ['산본','범계','명학','군포']
          },
'금천구청':{
        'name':'금천구청',
        'line':['1'],
        'time': 2,
        'around': ['석수','독산']
          },
'금촌':{
        'name':'금촌',
        'line':['경의중앙'],
        'time': 2,
        'around': ['월롱','금릉']
          },
'금호':{
        'name':'금호',
        'line':['3'],
        'time': 1,
        'around': ['옥수','약수']
          },
'길동':{
        'name':'길동',
        'line':['5'],
        'time': 1.5,
        'around': ['강동','굽은다리']
          },
'길음':{
        'name':'길음',
        'line':['4'],
        'time': 2,
        'around': ['성신여대입구','미아사거리']
          },
'김포공항':{
        'name':'김포공항',
        'line':['5', '9'],
        'time': 1.67,
        'around': ['개화','공항시장','개화산','송정']
          },
'까치산':{
        'name':'까치산',
        'line':['2','5'],
        'time': 2.5,
        'around': ['화곡','신정','신정네거리']
          },
'까치울':{
        'name':'까치울',
        'line':['7'],
        'time': 2,
        'around': ['부천종합운동장','온수']
          },
'낙성대':{
        'name':'낙성대',
        'line':['2'],
        'time': 2,
        'around': ['서울대입구','사당']
          },
'남구로':{
        'name':'남구로',
        'line':['7'],
        'time': 1.5,
        'around': ['가산디지털단지','대림']
          },
'남부터미널':{
        'name':'남부터미널',
        'line':['3'],
        'time': 1.5,
        'around': ['교대','양재']
          },
'남성':{
        'name':'남성',
        'line':['7'],
        'time': 1.33,
        'around': ['숭실대입구','총신대입구']
          },
'남영':{
        'name':'남영',
        'line':['1'],
        'time': 2,
        'around': ['용산','서울역']
          },
'남태령':{
        'name':'남태령',
        'line':['4'],
        'time': 2,
        'around': ['선바위','사당']
          },
'남한산성입구':{
        'name':'남한산성입구',
        'line':['8'],
        'time': 2.16,
        'around': ['산성','단대오거리']
          },
'내방':{
        'name':'내방',
        'line':['7'],
        'time': 2.5,
        'around': ['고속터미널','총신대입구']
          },
'노들':{
        'name':'노들',
        'line':['9'],
        'time': 2,
        'around': ['노량진','흑석']
          },
'노량진':{
        'name':'노량진',
        'line':['1','9'],
        'time': 2,
        'around': ['대방','용산','노들','샛강']
          },
'노원':{
        'name':'노원',
        'line':['4','7'],
        'time': 1.5,
        'around': ['마들','중계','상계','창동']
          },
'녹번':{
        'name':'녹번',
        'line':['3'],
        'time': 1.5,
        'around': ['홍제','불광']
          },
'녹사평':{
        'name':'녹사평',
        'line':['6'],
        'time': 1.67,
        'around': ['이태원','삼각지']
          },
'녹양':{
        'name':'녹양',
        'line':['1'],
        'time': 2,
        'around': ['가능','양주']
          },
'녹천':{
        'name':'녹천',
        'line':['1'],
        'time': 2,
        'around': ['월계','창동']
          },
'논현':{
        'name':'논현',
        'line':['7'],
        'time': 1.33,
        'around': ['학동','반포']
          },
'능곡':{
        'name':'능곡',
        'line':['경의중앙'],
        'time': 2,
        'around': ['행신','대곡']
          },
'단대오거리':{
        'name':'단대오거리',
        'line':['8'],
        'time': 1.16,
        'around': ['신흥','남한산성입구']
          },
'답십리':{
        'name':'답십리',
        'line':['5'],
        'time': 1.67,
        'around': ['마장','장한평']
          },
'당고개':{
        'name':'당고개',
        'line':['4'],
        'time': 4.5,
        'around': ['상계']
          },
'당산':{
        'name':'당산',
        'line':['2','9'],
        'time': 1.5,
        'around': ['합정','영등포구청','선유도','국회의사당']
          },
'당정':{
        'name':'당정',
        'line':['1'],
        'time': 2,
        'around': ['군포','의왕']
          },
'대곡':{
        'name':'대곡',
        'line':['3','경의중앙'],
        'time': 2,
        'around': ['백석','화정','곡산','능곡']
          },
'대공원':{
        'name':'대공원',
        'line':['4'],
        'time': 2,
        'around': ['경마공원','과천']
          },
'대림':{
        'name':'대림',
        'line':['2','7'],
        'time': 1.5,
        'around': ['신도림','구로디지털단지','남구로','신풍']
          },
'대방':{
        'name':'대방',
        'line':['1'],
        'time': 2,
        'around': ['신길','노량진']
          },
'대야미':{
        'name':'대야미',
        'line':['4'],
        'time': 2,
        'around': ['반월','수리산']
          },
'대청':{
        'name':'대청',
        'line':['3'],
        'time': 1.5,
        'around': ['일원','학여울']
          },
'대치':{
        'name':'대치',
        'line':['3'],
        'time': 1,
        'around': ['학여울','도곡']
          },
'대화':{
        'name':'대화',
        'line':['3'],
        'time': 2,
        'around': ['주엽']
          },
'대흥':{
        'name':'대흥',
        'line':['6'],
        'time': 1.5,
        'around': ['광흥창','공덕']
          },
'덕계':{
        'name':'덕계',
        'line':['1'],
        'time': 2,
        'around': ['덕정','양주']
          },
'덕소':{
        'name':'덕소',
        'line':['경의중앙'],
        'time': 2,
        'around': ['양정','도심']
          },
'덕정':{
        'name':'덕정',
        'line':['1'],
        'time': 2,
        'around': ['지행','덕계']
          },
'도곡':{
        'name':'도곡',
        'line':['3'],
        'time': 1,
        'around': ['매봉','대치']
          },
'도농':{
        'name':'도농',
        'line':['경의중앙'],
        'time': 2,
        'around': ['구리','양정']
          },
'도림천':{
        'name':'도림천',
        'line':['2'],
        'time': 1.5,
        'around': ['양천구청','신도림']
          },
'도봉':{
        'name':'도봉',
        'line':['1'],
        'time': 2,
        'around': ['도봉산','방학']
          },
'도봉산':{
        'name':'도봉산',
        'line':['1','7'],
        'time': 4.5,
        'around': ['망월사','도봉','장암','수락산']
          },
'도심':{
        'name':'도심',
        'line':['경의중앙'],
        'time': 2,
        'around': ['덕소','팔당']
          },
'도원':{
        'name':'도원',
        'line':['1'],
        'time': 2,
        'around': ['제물포','동인천']
          },
'도화':{
        'name':'도화',
        'line':['1'],
        'time': 2,
        'around': ['제물포','주안']
          },
'독립문':{
        'name':'독립문',
        'line':['3'],
        'time': 1.5,
        'around': ['무악재','경복궁']
          },
'독바위':{
        'name':'독바위',
        'line':['6'],
        'time': 2,
        'around': ['연신내','불광']
          },
'독산':{
        'name':'독산',
        'line':['1'],
        'time': 2,
        'around': ['가산디지털단지','금천구청']
          },
'돌곶이':{
        'name':'돌곶이',
        'line':['6'],
        'time': 1.16,
        'around': ['석계','상월곡']
          },
'동대문':{
        'name':'동대문',
        'line':['1','4'],
        'time': 1,
        'around': ['혜화','동대문역사문화공원','종로5가','동묘앞']
          },
'동대문역사문화공원':{
        'name':'동대문역사문화공원',
        'line':['2','4','5'],
        'time': 1.5,
        'around': ['동대문','충무로','을지로4가','청구','신당']
          },
'동대입구':{
        'name':'동대입구',
        'line':['3'],
        'time': 1.5,
        'around': ['충무로','약수']
          },
'동두천':{
        'name':'동두천',
        'line':['1'],
        'time': 2,
        'around': ['소요산','보산']
          },
'동두천중앙':{
        'name':'동두천중앙',
        'line':['1'],
        'time': 2,
        'around': ['보산','지행']
          },
'동묘앞':{
        'name':'동묘앞',
        'line':['1','6'],
        'time': 1.5,
        'around': ['창신','신당','동대문','신설동']
          },
'동암':{
        'name':'동암',
        'line':['1'],
        'time': 2,
        'around': ['백운','간석']
          },
'동인천':{
        'name':'동인천',
        'line':['1'],
        'time': 2,
        'around': ['도원','인천']
          },
'동작':{
        'name':'동작',
        'line':['4','9'],
        'time': 3,
        'around': ['이촌','총신대입구','흑석','구반포']
          },
'두정':{
        'name':'두정',
        'line':['1'],
        'time': 2,
        'around': ['직산','천안']
          },
'둔촌동':{
        'name':'둔촌동',
        'line':['5'],
        'time': 1.84,
        'around': ['강동','올림픽공원']
          },
'둔촌오륜':{
        'name':'둔촌오륜',
        'line':['9'],
        'time': 2,
        'around': ['중앙보훈병원','올림픽공원']
          },
'중앙보훈병원':{
        'name':'중앙보훈병원',
        'line':['9'],
        'time': 2,
        'around': ['둔촌오륜']
          },
'등촌':{
        'name':'등촌',
        'line':['9'],
        'time': 2,
        'around': ['증미','염창']
          },
'디지털미디어시티':{
        'name':'디지털미디어시티',
        'line':['6','경의중앙'],
        'time': 1.5,
        'around': ['증산','월드컵경기장','수색','가좌']
          },
'뚝섬':{
        'name':'뚝섬',
        'line':['2'],
        'time': 1.5,
        'around': ['한양대','성수']
          },
'뚝섬유원지':{
        'name':'뚝섬유원지',
        'line':['7'],
        'time': 1.5,
        'around': ['건대입구','청담']
          },
'마곡':{
        'name':'마곡',
        'line':['5'],
        'time': 1.5,
        'around': ['송정','발산']
          },
'마곡나루':{
        'name':'마곡나루',
        'line':['9'],
        'time': 2,
        'around': ['신방화','양천향교']
          },
'마두':{
        'name':'마두',
        'line':['3'],
        'time': 2,
        'around': ['정발산','백석']
          },
'마들':{
        'name':'마들',
        'line':['7'],
        'time': 2,
        'around': ['수락산','노원']
          },
'마장':{
        'name':'마장',
        'line':['5'],
        'time': 1,
        'around': ['왕십리','답십리']
          },
'마포':{
        'name':'마포구청',
        'line':['5'],
        'time': 2,
        'around': ['여의나루','공덕']
},
'마포구청':{
        'name':'마포구청',
        'line':['6'],
        'time': 1.16,
        'around': ['월드컵경기장','망원']
          },
'망우':{
        'name':'망우',
        'line':['경의중앙'],
        'time': 2,
        'around': ['상봉','양원']
          },
'망원':{
        'name':'망원',
        'line':['6'],
        'time': 1.32,
        'around': ['마포구청','합정']
          },
'망월사':{
        'name':'망월사',
        'line':['1'],
        'time': 2,
        'around': ['회룡','도봉산']
          },
'매봉':{
        'name':'매봉',
        'line':['3'],
        'time': 1.5,
        'around': ['양재','도곡']
          },
'먹골':{
        'name':'먹골',
        'line':['7'],
        'time': 1.16,
        'around': ['중화','태릉입구']
          },
'면목':{
        'name':'면목',
        'line':['7'],
        'time': 1.16,
        'around': ['상봉','사가정']
          },
'명동':{
        'name':'명동',
        'line':['4'],
        'time': 1,
        'around': ['충무로','회현']
          },
'명일':{
        'name':'명일',
        'line':['5'],
        'time': 1.2,
        'around': ['고덕','굽은다리']
          },
'명학':{
        'name':'명학',
        'line':['1'],
        'time': 2,
        'around': ['안양','금정']
          },
'모란':{
        'name':'모란',
        'line':['8'],
        'time': 1.5,
        'around': ['수진']
          },
'목동':{
        'name':'목동',
        'line':['5'],
        'time': 1.2,
        'around': ['신정','오목교']
          },
'몽촌토성':{
        'name':'몽촌토성',
        'line':['8'],
        'time': 2,
        'around': ['잠실','강동구청']
          },
'무악재':{
        'name':'무악재',
        'line':['3'],
        'time': 2,
        'around': ['홍제','독립문']
          },
'문래':{
        'name':'문래',
        'line':['2'],
        'time': 2,
        'around': ['신도림','영등포구청']
          },
'문산':{
        'name':'문산',
        'line':['경의중앙'],
        'time': 2,
        'around': ['임진강','파주']
          },
'문정':{
        'name':'문정',
        'line':['8'],
        'time': 2,
        'around': ['가락시장','장지']
          },
'미아':{
        'name':'미아',
        'line':['4'],
        'time': 1.5,
        'around': ['미아사거리','수유']
          },
'미아사거리':{
        'name':'미아사거리',
        'line':['4'],
        'time': 2,
        'around': ['미아','길음']
          },
'반월':{
        'name':'반월',
        'line':['4'],
        'time': 2,
        'around': ['상록수','대야미']
          },
'반포':{
        'name':'반포',
        'line':['7'],
        'time': 2,
        'around': ['잠원','논현']
          },
'발산':{
        'name':'발산',
        'line':['5'],
        'time': 1.7,
        'around': ['마곡','우장산']
          },
'방배':{
        'name':'방배',
        'line':['2'],
        'time': 2,
        'around': ['사당','서초']
          },
'방이':{
        'name':'방이',
        'line':['5'],
        'time': 1.3,
        'around': ['올림픽공원','오금']
          },
'방학':{
        'name':'방학',
        'line':['1'],
        'time': 2,
        'around': ['도봉','창동']
          },
'방화':{
        'name':'방화',
        'line':['5'],
        'time': 2,
        'around': ['개화산']
          },
'배방':{
        'name':'배방',
        'line':['1'],
        'time': 2,
        'around': ['탕정','온양온천']
          },
'백마':{
        'name':'백마',
        'line':['경의중앙'],
        'time': 2,
        'around': ['풍산','곡산']
          },
'백석':{
        'name':'백석',
        'line':['3'],
        'time': 2,
        'around': ['마두','대곡']
          },
'백운':{
        'name':'백운',
        'line':['1'],
        'time': 2,
        'around': ['부평','동암']
          },
'버티고개':{
        'name':'버티고개',
        'line':['6'],
        'time': 1.5,
        'around': ['한강진','약수']
          },
'범계':{
        'name':'범계',
        'line':['4'],
        'time': 2,
        'around': ['금정','평촌']
          },
'병점':{
        'name':'병점',
        'line':['1'],
        'time': 2,
        'around': ['세류','세마','서동탄']
          },
'보라매':{
        'name':'보라매',
        'line':['7'],
        'time': 1.2,
        'around': ['신대방삼거리','신풍']
          },
'보문':{
        'name':'보문',
        'line':['6'],
        'time': 1.2,
        'around': ['창신','안암']
          },
'보산':{
        'name':'보산',
        'line':['1'],
        'time': 2,
        'around': ['동두천','동두천중앙']
          },
'복정':{
        'name':'복정',
        'line':['8'],
        'time': 1.2,
        'around': ['남위례','장지']
          },
'봉명':{
        'name':'봉명',
        'line':['1'],
        'time': 2,
        'around': ['천안','쌍용']
          },
'봉은사':{
        'name':'봉은사',
        'line':['9'],
        'time': 2,
        'around': ['삼성중앙','종합운동장']
          },
'봉천':{
        'name':'봉천',
        'line':['2'],
        'time': 1,
        'around': ['삼성중앙','종합운동장']
          },

'봉화산':{
        'name':'봉화산',
        'line':['6'],
        'time': 1.3,
        'around': ['화랑대','신내']
          },
'부개':{
        'name':'부개',
        'line':['1'],
        'time': 2,
        'around': ['부평','송내']
          },
'부천':{
        'name':'부천',
        'line':['1'],
        'time': 2,
        'around': ['중동','소사']
          },
'부천시청':{
        'name':'부천시청',
        'line':['7'],
        'time': 2,
        'around': ['상동','신중동']
          },
'부천종합운동장':{
        'name':'부천종합운동장',
        'line':['7'],
        'time': 2,
        'around': ['춘의','까치울']
          },
'부평':{
        'name':'부평',
        'line':['1'],
        'time': 2,
        'around': ['부개','백운']
          },
'부평구청':{
        'name':'부평구청',
        'line':['7'],
        'time': 2,
        'around': ['산곡','굴포천']
          },
'불광':{
        'name':'불광',
        'line':['3','6'],
        'time': 2,
        'around': ['녹번','연신내','역촌','독바위']
          },
'사가정':{
        'name':'사가정',
        'line':['7'],
        'time': 1.2,
        'around': ['면목','용마산']
          },
'사당':{
        'name':'사당',
        'line':['2','4'],
        'time': 2.5,
        'around': ['낙성대','방배','총신대입구','남태령']
          },
'사평':{
        'name':'사평',
        'line':['9'],
        'time': 2,
        'around': ['고속터미널','신논현']
          },
'산본':{
        'name':'산본',
        'line':['4'],
        'time': 2,
        'around': ['금정','수리산']
          },
'산성':{
        'name':'산성',
        'line':['8'],
        'time': 1.7,
        'around': ['남위례','남한산성입구']
          },
'삼각지':{
        'name':'삼각지',
        'line':['4','6'],
        'time': 1.5,
        'around': ['숙대입구','신용산','효창공원앞','녹사평']
          },
'삼산체육관':{
        'name':'삼산체육관',
        'line':['7'],
        'time': 2,
        'around': ['상동','굴포천']
          },
'삼성':{
        'name':'삼성',
        'line':['2'],
        'time': 1.5,
        'around': ['선릉','종합운동장']
          },
'삼성중앙':{
        'name':'삼성중앙',
        'line':['9'],
        'time': 2,
        'around': ['봉은사','선정릉']
          },
'삼송':{
        'name':'삼송',
        'line':['3'],
        'time': 2,
        'around': ['원흥','지축']
          },
'상계':{
        'name':'상계',
        'line':['4'],
        'time': 2.5,
        'around': ['노원','당고개']
          },
'상도':{
        'name':'상도',
        'line':['7'],
        'time': 1.2,
        'around': ['장승배기','숭실대입구']
          },
'상동':{
        'name':'상동',
        'line':['7'],
        'time': 2,
        'around': ['부천시청','삼산체육관']
          },
'상록수':{
        'name':'상록수',
        'line':['4'],
        'time': 2,
        'around': ['한대앞','반월']
          },
'상봉':{
        'name':'상봉',
        'line':['7','경의중앙'],
        'time': 1.8,
        'around': ['중화','면목','중랑','망우']
          },
'상수':{
        'name':'상수',
        'line':['6'],
        'time': 1.2,
        'around': ['광흥창','합정']
          },
'상왕십리':{
        'name':'상왕십리',
        'line':['2'],
        'time': 1,
        'around': ['신당','왕십리']
          },
'상월곡':{
        'name':'상월곡',
        'line':['6'],
        'time': 1.2,
        'around': ['월곡','돌곶이']
          },
'상일동':{
        'name':'상일동',
        'line':['5'],
        'time': 1.7,
        'around': ['고덕']
          },
'새절':{
        'name':'새절',
        'line':['6'],
        'time': 1.3,
        'around': ['응암','증산']
          },
'샛강':{
        'name':'샛강',
        'line':['9'],
        'time': 2,
        'around': ['여의도','노량진']
          },
'서강대':{
        'name':'서강대',
        'line':['경의중앙'],
        'time': 2,
        'around': ['홍대입구','공덕']
          },
'서대문':{
        'name':'서대문',
        'line':['5'],
        'time': 1,
        'around': ['충정로','광화문']
          },
'서동탄':{
        'name':'서동탄',
        'line':['1'],
        'time': 2,
        'around': ['병점']
          },
'서빙고':{
        'name':'서빙고',
        'line':['경의중앙'],
        'time': 2,
        'around': ['이촌','한남']
          },
'서울역':{
        'name':'서울역',
        'line':['1','4','경의중앙'],
        'time': 2,
        'around': ['회현','숙대입구','시청','남영','신촌']
          },
'서울대입구':{
        'name':'서울대입구',
        'line':['2'],
        'time': 1.5,
        'around': ['봉천','낙성대']
          },
'서정리':{
        'name':'서정리',
        'line':['1'],
        'time': 2,
        'around': ['송탄','평택지제']
          },
'서초':{
        'name':'서초',
        'line':['2'],
        'time': 1,
        'around': ['교대','방배']
          },
'석계':{
        'name':'석계',
        'line':['1','6'],
        'time': 1.3,
        'around': ['광운대','신이문','돌곶이','태릉입구']
          },
'석수':{
        'name':'석수',
        'line':['1'],
        'time': 2,
        'around': ['금천구청','관악']
          },
'석촌':{
        'name':'석촌',
        'line':['8','9'],
        'time': 1.8,
        'around': ['잠실','송파','석촌고분','송파나루']
          },
'석촌고분':{
        'name':'석촌',
        'line':['9'],
        'time': 2,
        'around': ['삼전','석촌']
          },
'삼전':{
        'name':'삼전',
        'line':['9'],
        'time': 2,
        'around': ['종합운동장','석촌고분']
          },
'선릉':{
        'name':'선릉',
        'line':['2'],
        'time': 1.5,
        'around': ['역삼','삼성']
          },
'선바위':{
        'name':'선바위',
        'line':['4'],
        'time': 2,
        'around': ['남태령','경마공원']
          },
'선유도':{
        'name':'선유도',
        'line':['9'],
        'time': 2,
        'around': ['신목동','당산']
          },
'선정릉':{
        'name':'선정릉',
        'line':['9'],
        'time': 2,
        'around': ['언주','삼성중앙']
          },
'성균관대':{
        'name':'성균관대',
        'line':['1'],
        'time': 2,
        'around': ['의왕','화서']
          },
'성수':{
        'name':'성수',
        'line':['2'],
        'time': 1,
        'around': ['용답','뚝섬','건대입구']
          },
'성신여대입구':{
        'name':'성신여대입구',
        'line':['4'],
        'time': 2,
        'around': ['길음','한성대입구']
          },
'성환':{
        'name':'성환',
        'line':['1'],
        'time': 2,
        'around': ['평택','직산']
          },
'세류':{
        'name':'세류',
        'line':['1'],
        'time': 2,
        'around': ['수원','병점']
          },
'세마':{
        'name':'세마',
        'line':['1'],
        'time': 2,
        'around': ['병점','오산대']
          },
'소사':{
        'name':'소사',
        'line':['1'],
        'time': 2,
        'around': ['부천','역곡']
          },
'소요산':{
        'name':'소요산',
        'line':['1'],
        'time': 2,
        'around': ['동두천']
          },
'송내':{
        'name':'송내',
        'line':['1'],
        'time': 2,
        'around': ['부개','중동']
          },
'송정':{
        'name':'송정',
        'line':['5'],
        'time': 2.2,
        'around': ['마곡','김포공항']
          },
'송탄':{
        'name':'송탄',
        'line':['1'],
        'time': 2,
        'around': ['진위','서정리']
          },
'송파':{
        'name':'송파',
        'line':['8'],
        'time': 1.2,
        'around': ['석촌','가락시장']
          },
'송파나루':{
        'name':'송파나루',
        'line':['9'],
        'time': 2,
        'around': ['한성백제','석촌']
          },
'수락산':{
        'name':'수락산',
        'line':['7'],
        'time': 2.3,
        'around': ['도봉산','마들']
          },
'수색':{
        'name':'수색',
        'line':['경의중앙'],
        'time': 2,
        'around': ['화전','디지털미디어시티']
          },
'수서':{
        'name':'수서',
        'line':['3'],
        'time': 2,
        'around': ['일원','가락시장']
          },
'수원':{
        'name':'수원',
        'line':['1'],
        'time': 2,
        'around': ['화서','세류']
          },
'수유':{
        'name':'수유',
        'line':['4'],
        'time': 2,
        'around': ['쌍문','미아']
          },
'수진':{
        'name':'수진',
        'line':['8'],
        'time': 1.2,
        'around': ['모란','신흥']
          },
'숙대입구':{
        'name':'숙대입구',
        'line':['4'],
        'time': 1.5,
        'around': ['서울역','삼각지']
          },
'숭실대입구':{
        'name':'숭실대입구',
        'line':['7'],
        'time': 2.5,
        'around': ['상도','남성']
          },
'시청':{
        'name':'시청',
        'line':['1','2'],
        'time': 2,
        'around': ['종각','서울역','충정로','을지로입구']
          },
'신금호':{
        'name':'신금호',
        'line':['5'],
        'time': 1.5,
        'around': ['청구','행당']
          },
'신길':{
        'name':'신길',
        'line':['1','5'],
        'time': 1.5,
        'around': ['영등포','대방','영등포시장','여의도']
          },
'신길온천':{
        'name':'신길온천',
        'line':['4'],
        'time': 2,
        'around': ['정왕','안산']
          },
'신내':{
        'name':'신내',
        'line':['6'],
        'time': 4.5,
        'around': ['봉화산']
          },
'신논현':{
        'name':'신논현',
        'line':['9'],
        'time': 2,
        'around': ['사평','언주']
          },
'신답':{
        'name':'신답',
        'line':['2'],
        'time': 1.5,
        'around': ['용두','용답']
          },
'신당':{
        'name':'신당',
        'line':['2','6'],
        'time': 1.5,
        'around': ['동대문역사문화공원','상왕십리','동묘앞','청구']
          },
'신대방':{
        'name':'신대방',
        'line':['2'],
        'time': 2,
        'around': ['구로디지털단지','신림']
          },
'신대방삼거리':{
        'name':'신대방삼거리',
        'line':['7'],
        'time': 1.8,
        'around': ['보라매','장승배기']
          },
'신도림':{
        'name':'신도림',
        'line':['1','2'],
        'time': 2.5,
        'around': ['구로','영등포','문래','대림']
          },
'신림':{
        'name':'신림',
        'line':['2'],
        'time': 1.5,
        'around': ['신대방','봉천']
          },
'신목동':{
        'name':'신목동',
        'line':['9'],
        'time': 2,
        'around': ['선유도','염창']
          },
'신반포':{
        'name':'신반포',
        'line':['9'],
        'time': 2,
        'around': ['구반포','고속터미널']
          },
'신방화':{
        'name':'신방화',
        'line':['9'],
        'time': 2,
        'around': ['공항시장','마곡나루']
          },
'신사':{
        'name':'신사',
        'line':['3'],
        'time': 2,
        'around': ['압구정','잠원']
          },
'신설동':{
        'name':'신설동',
        'line':['1','2'],
        'time': 1.5,
        'around': ['동묘앞','제기동','용두']
          },
'신용산':{
        'name':'신용산',
        'line':['4'],
        'time': 1,
        'around': ['삼각지','이촌']
          },
'신원':{
        'name':'신원',
        'line':['경의중앙'],
        'time': 2,
        'around': ['양수','국수']
          },
'신이문':{
        'name':'신이문',
        'line':['1'],
        'time': 2,
        'around': ['석계','외대앞']
          },
'신정':{
        'name':'신정',
        'line':['5'],
        'time': 1.8,
        'around': ['까치산','목동']
          },
'신정네거리':{
        'name':'신정네거리',
        'line':['2'],
        'time': 3,
        'around': ['까치산','양천구청']
          },
'신중동':{
        'name':'신중동',
        'line':['7'],
        'time': 2,
        'around': ['부천시청','춘의']
          },
'신창':{
        'name':'신창',
        'line':['1'],
        'time': 2,
        'around': ['온양온천']
          },
'신촌':{
        'name':'신촌',
        'line':['2','경의중앙'],
        'time': 2,
        'around': ['이대','홍대입구','가좌','서울역']
          },
'신풍':{
        'name':'신풍',
        'line':['7'],
        'time': 1.3,
        'around': ['대림','보라매']
          },
'신흥':{
        'name':'신흥',
        'line':['8'],
        'time': 1.2,
        'around': ['수진','단대오거리']
          },
'쌍문':{
        'name':'쌍문',
        'line':['4'],
        'time': 2,
        'around': ['창동','수유']
          },
'쌍용':{
        'name':'쌍용',
        'line':['1'],
        'time': 2,
        'around': ['봉명','아산']
          },
'아산':{
        'name':'아산',
        'line':['1'],
        'time': 2,
        'around': ['쌍용','탕정']
          },
'아신':{
        'name':'아신',
        'line':['경의중앙'],
        'time': 2,
        'around': ['오빈','국수']
          },
'아차산':{
        'name':'아차산',
        'line':['5'],
        'time': 1.5,
        'around': ['군자','광나루']
          },
'아현':{
        'name':'아현',
        'line':['2'],
        'time': 1,
        'around': ['이대','충정로']
          },
'안국':{
        'name':'안국',
        'line':['3'],
        'time': 1.5,
        'around': ['경복궁','종로3가']
          },
'안산':{
        'name':'안산',
        'line':['4'],
        'time': 2,
        'around': ['신길온천','초지']
          },
'안암':{
        'name':'안암',
        'line':['6'],
        'time': 1.2,
        'around': ['보문','고려대']
          },
'안양':{
        'name':'안양',
        'line':['1'],
        'time': 2,
        'around': ['관악','명학']
          },
'암사':{
        'name':'암사',
        'line':['8'],
        'time': 2,
        'around': ['천호']
          },
'압구정':{
        'name':'압구정',
        'line':['3'],
        'time': 2.5,
        'around': ['신사','옥수']
          },
'애오개':{
        'name':'애오개',
        'line':['5'],
        'time': 1.3,
        'around': ['충정로','공덕']
          },
'약수':{
        'name':'약수',
        'line':['3','6'],
        'time': 1.5,
        'around': ['동대입구','금호','청구','버티고개']
          },
'언주':{
        'name':'언주',
        'line':['9'],
        'time': 2,
        'around': ['신논현','선정릉']
          },
'양수':{
        'name':'양수',
        'line':['경의중앙'],
        'time': 2,
        'around': ['운길산','신원']
          },
'양원':{
        'name':'양원',
        'line':['경의중앙'],
        'time': 2,
        'around': ['구리','망우']
          },
'양재':{
        'name':'양재',
        'line':['3'],
        'time': 2,
        'around': ['남부터미널','매봉']
          },
'양주': {
        'name': '양주',
        'line': ['1'],
        'time': 2,
        'around': ['덕계', '녹양']
    },
    '양천구청': {
        'name': '양천구청',
        'line': ['2'],
        'time': 2.5,
        'around': ['신정네거리', '도림천']
    },
    '양천향교': {
        'name': '양천향교',
        'line': ['9'],
        'time': 2,
        'around': ['마곡나루', '가양']
    },
    '양평': {
        'name': '양평',
        'line': ['5', '경의중앙'],
        'time': 1.5,
        'around': ['원덕', '오빈', '오목교', '영등포구청']
    },
    '어린이대공원': {
        'name': '어린이대공원',
        'line': ['7'],
        'time': 1.3,
        'around': ['군자', '건대입구']
    },
    '여의나루': {
        'name': '여의나루',
        'line': ['5'],
        'time': 1.3,
        'around': ['여의도', '마포']
    },
    '여의도': {
        'name': '여의도',
        'line': ['5', '9'],
        'time': 1.5,
        'around': ['여의나루', '신길', '국회의사당', '샛강']
    },
    '역곡': {
        'name': '역곡',
        'line': ['1'],
        'time': 2,
        'around': ['소사', '온수']
    },
    '역삼': {
        'name': '역삼',
        'line': ['2'],
        'time': 1.5,
        'around': ['강남', '선릉']
    },
    '역촌': {
        'name': '역촌',
        'line': ['6'],
        'time': 2,
        'around': ['불광', '응암']
    },
    '연신내': {
        'name': '연신내',
        'line': ['3', '6'],
        'time': 2.5,
        'around': ['구파발', '구산', '독바위', '불광']
    },
    '염창': {
        'name': '염창',
        'line': ['9'],
        'time': 2,
        'around': ['등촌', '신목동']
    },
    '영등포': {
        'name': '영등포',
        'line': ['1'],
        'time': 2,
        'around': ['신도림', '신길']
    },
    '영등포구청': {
        'name': '영등포구청',
        'line': ['2', '5'],
        'time': 1.2,
        'around': ['양평', '영등포시장', '당산', '문래']
    },
    '영등포시장': {
        'name': '영등포시장',
        'line': ['5'],
        'time': 1.2,
        'around': ['영등포구청', '신길']
    },
    '오금': {
        'name': '오금',
        'line': ['3', '5'],
        'time': 1.5,
        'around': ['개롱', '방이', '경찰병원']
    },
    '오류동': {
        'name': '오류동',
        'line': ['1'],
        'time': 2,
        'around': ['온수', '개봉']
    },
    '오목교': {
        'name': '오목교',
        'line': ['5'],
        'time': 1.3,
        'around': ['목동', '양평']
    },
    '오빈': {
        'name': '오빈',
        'line': ['경의중앙'],
        'time': 2,
        'around': ['양평', '아신']
    },
    '오산': {
        'name': '오산',
        'line': ['1'],
        'time': 2,
        'around': ['오산대', '진위']
    },
    '오산대': {
        'name': '오산대',
        'line': ['1'],
        'time': 2,
        'around': ['세마', '오산']
    },
    '오이도': {
        'name': '오이도',
        'line': ['4'],
        'time': 2,
        'around': ['정왕']
    },
    '옥수': {
        'name': '옥수',
        'line': ['3', '경의중앙'],
        'time': 1,
        'around': ['금호', '압구정', '한남', '응봉']
    },
    '온수': {
        'name': '온수',
        'line': ['1', '7'],
        'time': 2.3,
        'around': ['까치울', '오류동', '역곡', '천왕']
    },
    '온양온천': {
        'name': '온양온천',
        'line': ['1'],
        'time': '2',
        'around': ['배방', '신창']
    },
    '올림픽공원': {
        'name': '올림픽공원',
        'line': ['5', '9'],
        'time': 1.7,
        'around': ['둔촌동','방이','둔촌오륜','한성백제']
    },
    '왕십리': {
        'name': '왕십리',
        'line': ['2', '5', '경의중앙'],
        'time': 1.1,
        'around': ['행당', '마장', '청량리', '응봉', '상왕십리', '한양대']
    },
    '외대앞': {
        'name': '외대앞',
        'line': ['1'],
        'time': 2,
        'around': ['회기', '신이문']
    },
    '용답': {
        'name': '용답',
        'line': ['2'],
        'time': 1.5,
        'around': ['신답', '성수']
    },
    '용두': {
        'name': '용두',
        'line': ['2'],
        'time': 1.5,
        'around': ['신설동', '신답']
    },
    '용마산': {
        'name': '용마산',
        'line': ['7'],
        'time': 1.2,
        'around': ['사가정', '중곡']
    },
    '용문': {
        'name': '용문',
        'line': ['경의중앙'],
        'time': 2,
        'around': ['지평', '원덕']
    },
    '용산': {
        'name': '용산',
        'line': ['1', '경의중앙'],
        'time': 2,
        'around': ['이촌', '효창공원앞', '남영', '노량진']
    },
    '우장산': {
        'name': '우장산',
        'line': ['5'],
        'time': 1.5,
        'around': ['화곡', '발산']
    },
    '운길산': {
        'name': '운길산',
        'line': ['경의중앙'],
        'time': 2,
        'around': ['팔당', '양수']
    },
    '운정': {
        'name': '운정',
        'line': ['경의중앙'],
        'time': 2,
        'around': ['금릉', '야당']
    },
    '원당': {
        'name': '원당',
        'line': ['3'],
        'time': 2,
        'around': ['화정', '원흥']
    },
    '원덕': {
        'name': '원덕',
        'line': ['경의중앙'],
        'time': 2,
        'around': ['용문', '양평']
    },
    '월계': {
        'name': '월계',
        'line': ['1'],
        'time': 2,
        'around': ['광운대', '녹천']
    },
    '월곡': {
        'name': '월곡',
        'line': ['6'],
        'time': 1.7,
        'around': ['고려대', '상월곡']
    },
    '월드컵경기장': {
        'name': '월드컵경기장',
        'line': ['6'],
        'time': 1.2,
        'around': ['마포구청', '디지털미디어시티']
    },
    '월롱': {
        'name': '월롱',
        'line': ['경의중앙'],
        'time': 2,
        'around': ['파주', '금촌']
    },
    '을지로3가': {
        'name': '을지로3가',
        'line': ['2', '3'],
        'time': 1,
        'around': ['을지로입구', '을지로4가', '종로3가', '충무로']
    },
    '을지로4가': {
        'name': '을지로4가',
        'line': ['2', '5'],
        'time': 1,
        'around': ['동대문역사문화공원', '을지로3가', '종로3가']
    },
    '을지로입구': {
        'name': '을지로입구',
        'line': ['2'],
        'time': 1.5,
        'around': ['시청', '을지로3가']
    },
    '응봉': {
        'name': '응봉',
        'line': ['경의중앙'],
        'time': 2,
        'around': ['옥수', '왕십리']
    },
    '응암': {
        'name': '응암',
        'line': ['6'],
        'time': 2,
        'around': ['구산', '역촌', '새절']
    },
    '의왕': {
        'name': '의왕',
        'line': ['1'],
        'time': 2,
        'around': ['성균관대', '당정']
    },
    '의정부': {
        'name': '의정부',
        'line': ['1'],
        'time': 2,
        'around': ['가능', '회룡']
    },
    '이대': {
        'name': '이대',
        'line': ['2'],
        'time': 1,
        'around': ['아현', '신촌']
    },
    '이촌': {
        'name': '이촌',
        'line': ['4', '경의중앙'],
        'time': 2,
        'around': ['신용산', '동작', '용산', '서빙고']
    },
    '이태원': {
        'name': '이태원',
        'line': ['6'],
        'time': 1.2,
        'around': ['녹사평', '한강진']
    },
    '인덕원': {
        'name': '인덕원',
        'line': ['4'],
        'time': 2,
        'around': ['평촌', '정부과천청사']
    },
    '인천': {
        'name': '인천',
        'line': ['1'],
        'time': 2,
        'around': ['동인천']
    },
    '일산': {
        'name': '일산',
        'line': ['경의중앙'],
        'time': 2,
        'around': ['탄현', '풍산']
    },
    '일원': {
        'name': '일원',
        'line': ['3'],
        'time': 1.5,
        'around': ['대청', '수서']
    },
    '잠실': {
        'name': '잠실',
        'line': ['2', '8'],
        'time': 1.5,
        'around': ['잠실나루', '잠실새내', '몽촌토성', '석촌']
    },
    '잠실나루': {
        'name': '잠실나루',
        'line': ['2'],
        'time': 2,
        'around': ['잠실', '강변']
    },
    '잠실새내': {
        'name': '잠실새내',
        'line': ['2'],
        'time': 1.5,
        'around': ['잠실', '종합운동장']
    },
    '잠원': {
        'name': '잠원',
        'line': ['3'],
        'time': 1,
        'around': ['신사', '고속터미널']
    },
    '장승배기': {
        'name': '장승배기',
        'line': ['7'],
        'time': 1.5,
        'around': ['신대방삼거리', '상도']
    },
    '장암': {
        'name': '장암',
        'line': ['7'],
        'time': 2,
        'around': ['도봉산']
    },
    '장지': {
        'name': '장지',
        'line': ['8'],
        'time': 1.2,
        'around': ['복정', '문정']
    },
    '장한평': {
        'name': '장한평',
        'line': ['5'],
        'time': 1.7,
        'around': ['답십리', '군자']
    },
    '정발산': {
        'name': '정발산',
        'line': ['3'],
        'time': 2,
        'around': ['주엽', '마두']
    },
    '정부과천청사': {
        'name': '정부과천청사',
        'line': ['4'],
        'time': 2,
        'around': ['인덕원', '과천']
    },
    '정왕': {
        'name': '정왕',
        'line': ['4'],
        'time': 2,
        'around': ['오이도', '신길온천']
    },
    '제기동': {
        'name': '제기동',
        'line': ['1'],
        'time': 1.5,
        'around': ['청량리', '신설동']
    },
    '제물포': {
        'name': '제물포',
        'line': ['1'],
        'time': 2,
        'around': ['도원', '도화']
    },
    '종각': {
        'name': '종각',
        'line': ['1'],
        'time': 1.5,
        'around': ['시청', '종로3가']
    },
    '종로3가': {
        'name': '종로3가',
        'line': ['1', '3', '5'],
        'time': 1.5,
        'around': ['광화문', '을지로4가', '안국', '을지로3가', '종각', '종로5가']
    },
    '종로5가': {
        'name': '종로5가',
        'line': ['1'],
        'time': 1.5,
        'around': ['동대문', '종로3가']
    },
    '종합운동장': {
        'name': '종합운동장',
        'line': ['2', '9'],
        'time': 1.5,
        'around': ['삼성', '잠실새내', '봉은사', '삼전']
    },
    '주안': {
        'name': '주안',
        'line': ['1'],
        'time': 2,
        'around': ['도화', '간석']
    },
    '주엽': {
        'name': '주엽',
        'line': ['3'],
        'time': 2,
        'around': ['대화', '정발산']
    },
    '중계': {
        'name': '중계',
        'line': ['7'],
        'time': 1.3,
        'around': ['노원', '하계']
    },
    '중곡': {
        'name': '중곡',
        'line': ['7'],
        'time': 1.3,
        'around': ['군자', '용마산']
    },
    '중동': {
        'name': '중동',
        'line': ['1'],
        'time': 2,
        'around': ['송내', '부천']
    },
    '중랑': {
        'name': '중랑',
        'line': ['경의중앙'],
        'time': 2,
        'around': ['회기', '상봉']
    },
    '중앙': {
        'name': '중앙',
        'line': ['4'],
        'time': 2,
        'around': ['고잔', '한대앞']
    },
    '중화': {
        'name': '중화',
        'line': ['7'],
        'time': 1.3,
        'around': ['상봉', '먹골']
    },
    '증미': {
        'name': '증미',
        'line': ['9'],
        'time': 2,
        'around': ['가양', '등촌']
    },
    '증산': {
        'name': '증산',
        'line': ['6'],
        'time': 1.3,
        'around': ['새절', '디지털미디어시티']
    },
    '지평': {
        'name': '지평',
        'line': ['경의중앙'],
        'time': 2,
        'around': ['용문']
    },
    '지축': {
        'name': '지축',
        'line': ['3'],
        'time': 2,
        'around': ['삼송', '구파발']
    },
    '지행': {
        'name': '지행',
        'line': ['1'],
        'time': 2,
        'around': ['동두천중앙', '덕정']
    },
    '직산': {
        'name': '직산',
        'line': ['1'],
        'time': 2,
        'around': ['성환', '두정']
    },
    '진위': {
        'name': '진위',
        'line': ['1'],
        'time': 2,
        'around': ['오산', '송탄']
    },
    '창동': {
        'name': '창동',
        'line': ['1', '4'],
        'time': 1.5,
        'around': ['쌍문', '노원', '방학', '녹천']
    },
    '창신': {
        'name': '창신',
        'line': ['6'],
        'time': 1.3,
        'around': ['보문', '동묘앞']
    },
    '천안': {
        'name': '천안',
        'line': ['1'],
        'time': 2,
        'around': ['두정', '봉명']
    },
    '천왕': {
        'name': '천왕',
        'line': ['7'],
        'time': 2,
        'around': ['온수', '광명사거리']
    },
    '천호': {
        'name': '천호',
        'line': ['5', '8'],
        'time': 1.5,
        'around': ['광나루', '강동', '암사', '강동구청']
    },
    '철산': {
        'name': '철산',
        'line': ['7'],
        'time': 2,
        'around': ['가산디지털단지', '광명사거리']
    },
    '청구': {
        'name': '청구',
        'line': ['5', '6'],
        'time': 1.2,
        'around': ['동대문역사문화공원', '신당', '약수', '신금호']
    },
    '청담': {
        'name': '청담',
        'line': ['7'],
        'time': 2.5,
        'around': ['강남구청', '뚝섬유원지']
    },
    '청량리': {
        'name': '청량리',
        'line': ['1', '경의중앙'],
        'time': 2,
        'around': ['제기동', '회기', '왕십리']
    },
    '초지': {
        'name': '초지',
        'line': ['4'],
        'time': 2,
        'around': ['안산', '고잔']
    },
    '총신대입구': {
        'name': '총신대입구',
        'line': ['4', '7'],
        'time': 2.5,
        'around': ['남성', '내방', '동작', '사당']
    },
    '춘의': {
        'name': '춘의',
        'line': ['7'],
        'time': 2,
        'around': ['신중동', '부천종합운동장']
    },
    '충무로': {
        'name': '충무로',
        'line': ['3', '4'],
        'time': 1.5,
        'around': ['명동', '동대문역사문화공원', '동대입구', '을지로3가']
    },
    '충정로': {
        'name': '충정로',
        'line': ['2', '5'],
        'time': 1.5,
        'around': ['서대문', '애오개', '시청', '아현']
    },
    '탄현': {
        'name': '탄현',
        'line': ['경의중앙'],
        'time': 2,
        'around': ['야당', '일산']
    },
    '탕정': {
        'name': '탕정',
        'line': ['1'],
        'time': 2,
        'around': ['아산', '배방']
    },
    '태릉입구': {
        'name': '태릉입구',
        'line': ['6', '7'],
        'time': 1.2,
        'around': ['석계', '화랑대', '공릉', '먹골']
    },
    '파주': {
        'name': '파주',
        'line': ['경의중앙'],
        'time': 2,
        'around': ['문산', '월롱']
    },
    '팔당': {
        'name': '팔당',
        'line': ['경의중앙'],
        'time': 2,
        'around': ['운길산', '도심']
    },
    '평촌': {
        'name': '평촌',
        'line': ['4'],
        'time': 2,
        'around': ['범계', '인덕원']
    },
    '평택': {
        'name': '평택',
        'line': ['1'],
        'time': 2,
        'around': ['평택지제', '성환']
    },
    '평택지제': {
        'name': '평택지제',
        'line': ['1'],
        'time': 2,
        'around': ['평택', '서정리']
    },
    '풍산': {
        'name': '풍산',
        'line': ['경의중앙'],
        'time': 2,
        'around': ['일산', '백마']
    },
    '하계': {
        'name': '하계',
        'line': ['7'],
        'time': 1.2,
        'around': ['중계', '공릉']
    },
    '학동': {
        'name': '학동',
        'line': ['7'],
        'time': 1.2,
        'around': ['논현', '강남구청']
    },
    '학여울': {
        'name': '학여울',
        'line': ['3'],
        'time': 1,
        'around': ['대치', '대청']
    },
    '한강진': {
        'name': '한강진',
        'line': ['6'],
        'time': 1.5,
        'around': ['이태원', '버티고개']
    },
    '한남': {
        'name': '한남',
        'line': ['경의중앙'],
        'time': 2,
        'around': ['서빙고', '옥수']
    },
    '한대앞': {
        'name': '한대앞',
        'line': ['4'],
        'time': 2,
        'around': ['중앙', '상록수']
    },
    '한성대입구': {
        'name': '한성대입구',
        'line': ['4'],
        'time': 1.5,
        'around': ['성신여대입구', '혜화']
    },
    '한성백제': {
        'name': '한성백제',
        'line': ['9'],
        'time': 1.5,
        'around': ['송파나루', '올림픽공원']
    },
    '한양대': {
        'name': '한양대',
        'line': ['2'],
        'time': 1.5,
        'around': ['왕십리', '뚝섬']
    },
    '합정': {
        'name': '합정',
        'line': ['2', '6'],
        'time': 2.5,
        'around': ['망원', '상수', '당산', '홍대입구']
    },
    '행당': {
        'name': '행당',
        'line': ['5'],
        'time': 1.3,
        'around': ['신금호', '왕십리']
    },
    '행신': {
        'name': '행신',
        'line': ['경의중앙'],
        'time': 2,
        'around': ['능곡', '강매']
    },
    '혜화': {
        'name': '혜화',
        'line': ['4'],
        'time': 1.5,
        'around': ['한성대입구', '동대문']
    },
    '홍대입구': {
        'name': '홍대입구',
        'line': ['2', '경의중앙'],
        'time': 1.5,
        'around': ['신촌', '합정', '서강대', '가좌']
    },
    '홍제': {
        'name': '홍제',
        'line': ['3'],
        'time': 2,
        'around': ['녹번', '무악재']
    },
    '화곡': {
        'name': '화곡',
        'line': ['5'],
        'time': 1.5,
        'around': ['우장산', '까치산']
    },
    '화랑대': {
        'name': '화랑대',
        'line': ['6'],
        'time': 1.3,
        'around': ['태릉입구', '봉화산']
    },
    '화서': {
        'name': '화서',
        'line': ['1'],
        'time': 2,
        'around': ['성균관대', '수원']
    },
    '화전': {
        'name': '화전',
        'line': ['경의중앙'],
        'time': 2,
        'around': ['강매', '수색']
    },
    '화정': {
        'name': '화정',
        'line': ['3'],
        'time': 2,
        'around': ['대곡', '원당']
    },
    '회기': {
        'name': '회기',
        'line': ['1'],
        'time': 2,
        'around': ['청량리', '외대앞', '중랑']
    },
    '회룡': {
        'name': '회룡',
        'line': ['1'],
        'time': 2,
        'around': ['의정부', '망월사']
    },
    '회현': {
        'name': '회현',
        'line': ['4'],
        'time': 1,
        'around': ['서울역', '명동']
    },
    '효창공원앞': {
        'name': '효창공원앞',
        'line': ['6', '경의중앙'],
        'time': 1.3,
        'around': ['공덕', '용산', '삼각지']
    },
    '흑석': {
        'name': '흑석',
        'line': ['9'],
        'time': 2,
        'around': ['노들', '동작']
    },
#추가
    '남위례': {
        'name': '남위례',
        'line': ['8'],
        'time': 2,
        'around': ['복정', '산성']
    },
    '원흥': {
        'name': '원흥',
        'line': ['3'],
        'time': 2,
        'around': ['원당', '삼송']
    },
    '양정': {
        'name': '양정',
        'line': ['경의중앙'],
        'time': 2,
        'around': ['도농', '덕수']
    },
    '임진강': {
        'name': '임진강',
        'line': ['경의중앙'],
        'time': 2,
        'around': ['문산']
    },
    '야당': {
        'name': '야당',
        'line': ['경의중앙'],
        'time': 2,
        'around': ['운정', '탄현']
    },
    '마천': {
        'name': '마천',
        'line': ['5'],
        'time': 2,
        'around': ['거여']
    }
}
#n분안에 갈수 있는 역 찾는 함수
def search_station(line, station, n, time, visited={}):
    if time > n: return  # 소요시간이 n분을 넘어갈 경우 해당 역은 탐색하지 않는다

    around_stations = stations[station]['around']

    if station in visited:
        if visited[station] > time:
            visited[station] = time
        else:
            return
    else:
        visited[station] = time

    for st_name in around_stations:  # 주변 역들 탐색
        next_time = time + stations[st_name]['time']  # 다음 역까지 걸린 시간
        link = stations[station]['line']
        for riding in link:
            if line == "":  # 출발역 예외처리
                search_station(riding, st_name, n, next_time, visited)
            if riding == line:
                search_station(riding, st_name, n, next_time + 0.5, visited)  # 정차시간 추가
            else:
                search_station(riding, st_name, n, next_time + 3.5, visited)  # 정차시간 + 환승시간 + 대기시간
    st_list = list(visited.keys())
    return st_list

#llnearsearch방식 처음부터 그냥 검색하기
def linearSearch(list, n):
    intersection= []
    for station in list[0]:
        equal = True
        for i in range(1, n):
            flag = False
            for st in list[i]:
                if st == station:
                    flag = True
                    break
            if flag == False:
                equal = False
                break
        if equal == False:
            continue
        intersection.append(station)
    return intersection


def bubble_sort(arr):
    for end in range(1, len(arr)):
        for i in range(end, 0, -1):
            if arr[i - 1] > arr[i]:
                arr[i - 1], arr[i] = arr[i], arr[i - 1]


def binary(list, station):
    size = len(list)
    left = 0
    right = size - 1

    while left <= right:
        mid = int((left + right) / 2)
        if list[mid] == station:
            return True
        elif list[mid] > station:
            right = mid - 1
        else:
            left = mid + 1
    return False

#binarysearch방식
def binarySearch(list, n):
    #list를 bubblesort로 정렬시켜준다
    for arr in list:
        bubble_sort(arr)

    #list[0]에 나오는 역들을 기준으로 이진 탐색을 진행한다
    intersection = []
    for station in list[0]:
        equal = True
        for i in range(1, n):
            equal = equal and binary(list[i], station)
        if equal:
            intersection.append(station)
    return intersection

#hash 방식
def hashing(list, n):
    # dictionary형태로 hashing 테이블을 구성한다
    table = []

    for i in range(len(list)):
        dic = {station: 1 for station in list[i]}
        table.append(dic)

    #역들을 탐색한다
    intersection = []
    for station in list[0]:
        equal = True
        for i in range(1, n):
            val = table[i].get(station)
            if val == None:
                equal = False
                break
        if equal:
            intersection.append(station)
    return intersection

#교집합 얻기
def getList(list, n, method):
    intersection = method(list,n)
    return intersection

#최종 풀이 함수
def solution(station_list, n, func):
    time = 5
    while True:
        list = []
        #일정 시간 안에 갈 수 있는 역들을 찾는 부분
        for i in range(n):
            possible_station = search_station("", station_list[i], time, 0.0, {})
            list.append(possible_station)

        r_station = []
        r_station= getList(list, n, method=func)
        if r_station:
            break
        else:
            time = time + 5

    # 더 짧은 시간 안에 갈 수 있는 역들 재탐색
    for i in range(time - 1, time - 5, -1):
        list = []
        for j in range(n):
            possible_station = search_station("", station_list[j], i, 0.0, {})
            list.append(possible_station)
        fr_stations = getList(list, n, method=func)
        if fr_stations:
            r_station = fr_stations
            time = i
            continue
        else:
            break

    print("추천하는 만남역: ", r_station)

def getInput():
    n = int(input('총 몇명이십니까? '))
    station_list = []

    for i in range(n):
        temp = input(str(i+1)+'번째 출발하는 역을 입력해주세요: ')
        station_list.append(temp)

    return station_list, n

def main():
    func_list = [linearSearch, binarySearch, hashing]
    func_name = ['LinearSearch', 'BinarySearch', 'Hashing']
    station_list, n = getInput()
    print('==========================')
    for i in range(3):
        print(func_name[i])
        start = time.time()
        solution(station_list, n, func_list[i])
        end = time.time()
        t = end - start
        print(t)
        print('==========================')

# main()



def solution22222(station_list, n, func):
    time = 5
    while True:
        list = []
        #일정 시간 안에 갈 수 있는 역들을 찾는 부분
        for i in range(n):
            possible_station = search_station("", station_list[i], time, 0.0, {})
            list.append(possible_station)

        r_station = []
        r_station= getList(list, n, method=func)
        if r_station:
            break
        else:
            time = time + 5

    # 더 짧은 시간 안에 갈 수 있는 역들 재탐색
    for i in range(time - 1, time - 5, -1):
        list = []
        for j in range(n):
            possible_station = search_station("", station_list[j], i, 0.0, {})
            list.append(possible_station)
        fr_stations = getList(list, n, method=func)
        if fr_stations:
            r_station = fr_stations
            time = i
            continue
        else:
            break

    print("추천하는 만남역: ", r_station)



print(search_station("","충무로",17,0.0, visited={}))
print(search_station("","창동",17,0.0, visited={}))
print(search_station("","답십리",17,0.0, visited={}))